backend/artillery/load-test-large.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 120
      arrivalRate: 50
      name: 'Warm up'
    - duration: 300
      arrivalRate: 200
      name: 'Sustained load'
    - duration: 180
      arrivalRate: 500
      name: 'Peak load'
    - duration: 120
      arrivalRate: 200
      name: 'High load'
    - duration: 60
      arrivalRate: 50
      name: 'Cool down'
  defaults:
    headers:
      Content-Type: 'application/json'
  processor: './processor.js'
  pool: 100

scenarios:
  - name: 'User Registration and Login Flow'
    weight: 15
    flow:
      - post:
          url: '/auth/register'
          json:
            email: 'user-{{ $randomString() }}@example.com'
            name: 'Test User {{ $randomNumber(1, 100000) }}'
            password: 'Password123!'
          capture:
            - json: '$.accessToken'
              as: 'accessToken'
      - post:
          url: '/auth/login'
          json:
            email: 'loadtest@example.com'
            password: 'Password123!'

  - name: 'High-Frequency Login (Cache Test)'
    weight: 70
    flow:
      - post:
          url: '/auth/login'
          json:
            email: 'loadtest@example.com'
            password: 'Password123!'
          capture:
            - json: '$.accessToken'
              as: 'accessToken'
      - get:
          url: '/auth/me'
          headers:
            Authorization: 'Bearer {{ accessToken }}'

  - name: 'Token Operations'
    weight: 15
    flow:
      - post:
          url: '/auth/login'
          json:
            email: 'test{{ $randomNumber(1, 5) }}@example.com'
            password: 'Password123!'
          capture:
            - json: '$.accessToken'
              as: 'accessToken'
            - json: '$.refreshToken'
              as: 'refreshToken'
      - get:
          url: '/auth/me'
          headers:
            Authorization: 'Bearer {{ accessToken }}'
      - post:
          url: '/auth/refresh'
          json:
            refreshToken: '{{ refreshToken }}'
      - get:
          url: '/metrics'